Repository: fiddlededee/asciidoc-i18n
Catalog: src/i18n-adoc-*.po
Languages: ru

source: = Simple text markup internationalization (i18n): Gettext approach Nikolaj Potashnikov 1.0, 2022-01-11 :lang: en :toc: :toc-title: Table of contents
ru: // tag::main[] = Интернационализация (i18n) простой текстовой разметки: Подход с использованием `gettext` Поташников Николай 1.0, 2022-01-11 :lang: ru :toc: :toc-title: Содержание :figure-caption: Рисунок

source: == Introduction
ru: == Введение

source: https://habr.com/ru/post/599775/[Перейти к русской версии]
ru: https://habr.com/ru/post/599437/[ Go to English version]

source: Several years ago my colleague posted an https://dzone.com/articles/presentation-as-code-why-i-abandoned-powerpoint[article] about making presentations in https://asciidoctor.org/[Asciidoctor]. Since then, we don't use any other approach.
ru: Несколько лет назад коллега опубликовал https://habr.com/ru/post/456032/[статью] о создании презентации при помощи https://asciidoctor.org/[Asciidoctor]. С тех пор мы пользуемся только этим подходом.

source: Some time ago there have appeared a problem of translating presentations into several languages and have them synchronized. The solution appeared to be so simple and mature that I decided to describe it in this post.
ru: Недавно возникла проблема перевести презентации на несколько языков и обеспечить синхронизацию переводов по мере доработки оригинала. Решение оказалось настолько простым и отработанным, что я решил описать его в этой статье.

source: This solution is syntax-unaware. This means, it doesn't matter whether we use Asciidoc, other light text markup or even mixed format (with my favourite Plantuml or any other diagrams, for example). The serious limitations of this approach are (1) the translator shouldn't break markup structure and (2) we can't directly apply machine translation to the original text.
ru: Предлагаемое решение ничего не знает о синтаксисе. Это означает, что не так важно, используется Asciidoc, другой формат простой текстовой разметки или даже смешанный формат (например, включающий мои любимые Plantuml или любые другие диаграммы). Серьезные ограничения данного подхода -- (1) переводчик не должен ломать используемую разметку и (2) невозможно напрямую использовать машинный перевод.

source: The solution uses http://docs.translatehouse.org/projects/translate-toolkit/en/latest/[Translation Toolkit] and standard https://www.gnu.org/software/gettext/[GNU Gettext tools].
ru: Решение использует http://docs.translatehouse.org/projects/translate-toolkit/en/latest/[Translation Toolkit] и стандартные https://www.gnu.org/software/gettext/[инструменты GNU Gettext].

source: To make this solution clear this article has English and Russian versions. https://github.com/fiddlededee/asciidoc-i18n[Its repository] contains some simple automation that synchronizes translation, creates printing version (pdf, docx, odt) and creates Markdown file for publishing to Habr.
ru: Для демонстрации подхода у данной статьи есть английская и русская версия. https://github.com/fiddlededee/asciidoc-i18n[В её репозитории] настроена простая автоматизация, которая синхронизирует перевод, создает печатную версию статьи (pdf, docx, odt), а также создает файл в формате Markdown для публикации на Хабре.

source: In my recent article on testing documentation I didn't pay much attention to text linters, because the focus was on approaches, not exact tools. Still these tools are great. To fill the gap, I'll use https://github.com/errata-ai/vale[vale] for this article.
ru: В https://habr.com/ru/post/571326/[предыдущей статье о тестировании документации] я только упомянул стандартные текстовые линтеры, т.к. старался сфокусироваться в целом на подходах к тестированию, а не конкретных инструментах. Тем не менее существующие линтеры могут очень и очень многое. Поэтому эта статья проверялась при помощи https://github.com/errata-ai/vale[vale].

source: == The idea
ru: == Основная идея

source: Gettext assumes that key strings for translation are original messages.
ru: Gettext предполагает, что ключевые строки для перевода являются оригинальными сообщениями.

source: Gettext uses files with `.po` extension (PO -- https://www.gnu.org/software/gettext/manual/html_node/PO-Files.html#PO-Files[Portable Object]) to keep both original and translated messages. A great number of editors allow to edit such files either in a single user or collaborative environments.
ru: Gettext использует файлы расширением `.po` (PO -- https://www.gnu.org/software/gettext/manual/html_node/PO-Files.html#PO-Files[Portable Object]) для хранения как оригинальных, так и переведенных сообщений. Большое количество редакторов позволяет редактировать такие файлы как в однопользовательской, так и в многопользовательской среде.

source: The idea of Translation Toolkit is to use blocks of adjacent lines as such strings.
ru: Основная идея Translation Toolkit заключается в использовании блоков смежных строк в качестве констант для перевода.

source: Take this example: ---- .Winter is
ru: Рассмотрим пример: ---- .Зима -- это

source: * snow * frost
ru: * снег * мороз

source: * Christmas * New Year ----
ru: * Рожество * Новый год ----

source: It has three blocks of adjacent strings. Translation Toolkit will extract three key strings for translation and will put it to a file with the `.pot` extension (`.pot` stands for `.po` Template).
ru: В примере показано три блока смежных строк, поэтому Translation Toolkit извлечёт три константы для перевода и поместит их в файл с расширением `.pot` (шаблон `.po`)

source: Putting or removing line breaks in this example you may make any number of strings from 1 to 5. This depends on convenience to the translator.
ru: Вставляя или убирая переносы строк в данном примере вы можете получить любое количество констант в диапазоне от 1 до 5. Количество констант зависит от удобства для переводчика.

source: Using a `.pot` file as a template Gettext creates (updates) `.po` files for all required languages. Translators handle exactly these files. After that Translation Toolkit takes (1) a `.po` file with translation, (2) the original file and creates a final translated file.
ru: Используя файл `.pot` в качестве шаблона, Gettext создает (обновляет) файлы `.po` для всех требуемых языков. Переводчики работают именно с этими файлами. Далее Translation Toolkit берет (1) файл `.po` с переводом, (2) оригинальный файл и создает переведенный файл.

source: == The Process
ru: == Описание процесса

source: The process consists of the following steps.
ru: Процесс перевода состоит из следующих шагов.

source: * Initial steps to get initial translations in one or several languages. * Updating translation steps to synchronize translation with the modified original text.
ru: * Исходные шаги для получения первого перевода на один или несколько языков. * Обновление перевода после модификации исходного текста.

source: The following diagrams assume that the original file is `i18n-adoc.adoc` and the translation goes to `i18n-adoc-ru.adoc`.
ru: На следующих диаграммах предполагается, что исходный файл -- `i18n-adoc.adoc`, а перевод должен быть помещен в файл `i18n-adoc-ru.adoc`.

source: === Initial steps
ru: === Исходные шаги

source: .Initial steps
ru: .Исходные шаги

source: ifdef::backend-html5,backend-fodt[] [plantuml,initial_steps,fitrect="170x250mm",srcdpi=300, width=80%] .... @startuml skinparam dpi 300
ru: ifdef::backend-html5,backend-fodt[] [plantuml,initial_steps-ru,fitrect="170x250mm",srcdpi=300, width=80%] .... @startuml skinparam dpi 300

source: :Create a //.po// template with **Translation Toolkit** ==== <code> txt2po -P i18n-adoc.adoc i18n-adoc.pot </code>;
ru: :Создайте шаблон файла //.po// с помощью **Translation Toolkit** ==== <code> txt2po -P i18n-adoc.adoc i18n-adoc.pot </code>;

source: :Initialize a //.po// file with **Gettext** ==== <code> msginit --no-translator -l ru_RU -o i18n-adoc-ru.po </code>;
ru: :Инициализируйте файл //.po// для нужного языка с помощью **Gettext** ==== <code> msginit --no-translator -l ru_RU -o i18n-adoc-ru.po </code>;

source: :Make translation with any //.po// editor ==== Gtranslator, Poedit etc.;
ru: :Сделайте перевод с помощью любого редактора файлов //.po// ==== Gtranslator, Poedit etc.;

# i18n-adoc.adoc:96
source: :Create (update) the translated file with **Translation Toolkit** ==== <code> po2txt -t i18n-adoc.adoc i18n-adoc-ru.po i18n-adoc-ru.adoc </code>;
ru: :Создайте (обновите) перевод с помощью **Translation Toolkit** ==== <code> po2txt -t i18n-adoc.adoc i18n-adoc-ru.po i18n-adoc-ru.adoc </code>;

source: ifdef::backend-docbook5[] image::https://habrastorage.org/webt/0u/rs/zp/0urszpwyr0va0baicqejdrhr7vq.png[fitrect="170x250mm",srcdpi=300,width=80%] endif::[]
ru: ifdef::backend-docbook5[] image::https://habrastorage.org/webt/kf/n4/wv/kfn4wvlwpq4js2ystmekr9avbec.png[fitrect="170x250mm",srcdpi=300,width=80%] endif::[]

source: There is a vast number of editors for translating `.po` files. The following screenshot shows https://wiki.gnome.org/Apps/Gtranslator[Gtranslator] interface. I prefer https://poedit.net/[Poedit], although the way it replaces backtick with tick while applying machine translation is annoying.
ru: Существует много редакторов для перевода файлов `.po`. На следующем снимке экрана показан интерфейс https://wiki.gnome.org/Apps/Gtranslator[Gtranslator]. Я предпочитаю https://poedit.net/[Poedit], хотя то, как он заменяет гравис на апостроф при использовании машинного перевода, раздражает.

source: .Translating in Gtranslator
ru: .Перевод с использованием Gtranslator

source: === Updating translation
ru: === Обновление перевода

source: .Updating translation
ru: .Обновление перевода

source: ifdef::backend-html5,backend-fodt[] [plantuml,updating-translation,fitrect="170x250mm",srcdpi=300,width=80%] .... @startuml skinparam dpi 300
ru: ifdef::backend-html5,backend-fodt[] [plantuml,updating-translation-ru,fitrect="170x250mm",srcdpi=300,width=80%] .... @startuml skinparam dpi 300

source: :Recreate a //.po// template with **Translation Toolkit** ==== <code> txt2po -P i18n-adoc.adoc i18n-adoc.pot </code>;
ru: :Создайте шаблон файла //.po// с помощью **Translation Toolkit** ==== <code> txt2po -P i18n-adoc.adoc i18n-adoc.pot </code>;

source: :Merge the //.po// template with the existing //.po// file with **Gettext** ==== <code> msgmerge -U i18n-adoc-ru.po i18n-adoc.pot </code>;
ru: :Объедените шаблон и существующий файл //.po// с помощью **Gettext** ==== <code> txt2po -P i18n-adoc.adoc i18n-adoc.pot </code>;

source: :Update the translation with any //.po// editor ==== Gtranslator, Poedit etc.;
ru: :Обновите перевод с помощью любого редактора файлов //.po// ==== Gtranslator, Poedit etc.;

# i18n-adoc.adoc:148
source: :Create (update) the translated file with **Translation Toolkit** ==== <code> po2txt -t i18n-adoc.adoc i18n-adoc-ru.po i18n-adoc-ru.adoc </code>;
ru: :Создайте (обновите) перевод с помощью **Translation Toolkit** ==== <code> po2txt -t i18n-adoc.adoc i18n-adoc-ru.po i18n-adoc-ru.adoc </code>;

source: ifdef::backend-docbook5[] image::https://habrastorage.org/webt/um/ff/n3/umffn3yakhg2w72zm4xwbos_rki.png[fitrect="170x250mm",srcdpi=300,width=80%] endif::[]
ru: ifdef::backend-docbook5[] image::https://habrastorage.org/webt/zj/q0/up/zjq0up9icxyk07k5bapm_6_pt4u.png[fitrect="170x250mm",srcdpi=300,width=80%] endif::[]

source: == Some notes
ru: == Несколько замечаний

source: . In our documentation, we often reuse source i18n strings just to be sure that names of interface elements in documentation are equal to the same names in our application. We generate these i18n strings automatically in the following format: +
ru: . В нашей документации мы часто повторно используем константы интернационализации, чтобы имена элементов интерфейса в документации совпадали с именами этих же элементов в приложении. Мы генерируем эти константы автоматически в следующем формате: +

source: ---- :main-menu-documents: Documents :main-menu-documents-my: My ... ---- +
ru: ---- :main-menu-documents: Документы :main-menu-documents-my: Мои ... ---- +

source: We include such a file in the Asciidoc document like `include i17n-\{lang}.adoc[]`. Now there is no need to use attributes. Just translate `include i17n-en.adoc[]` to `include i17n-ru.adoc[]`.
ru: Мы включаем этот файл в документ Asciidoc (`include i17n-\{lang}.adoc[]`). Теперь нет необходимости использовать атрибуты. Просто переведите `include i17n-en.adoc[]` в `include i17n-ru.adoc[]`.

source: . When `gettext` updates the `.po` files, it uses fuzzy search. If you slightly change the original text, you won't lose its translation. It will be just marked as flaky.
ru: . Когда `gettext` обновляет файлы `.po`, он использует нечеткий поиск. Если вы немного измените исходный текст, перевод не пропадет. Он будет просто помечен как возможно неверный (flaky).

source: . It's easy to check whether translation file is up-to-date with a Gettext utility `msgfmt`. +
ru: . Актуальность файла с переводом проверить очень легко при помощи утилиты Gettext -- `msgfmt`. +

source: It shows the number of translated strings, the number of strings that need checking and the number of untranslated strings.
ru: Команда показывает количество переведенных строк, количество строк, которые нуждаются в проверке, и количество непереведенных строк.

source: == Conclusion
ru: == Заключение

source: * Translation Toolkit and Gettext make the process of documentation internationalization quite efficient.
ru: * Translation Toolkit и Gettext обеспечивают эффективную интернационализацию документации.

source: * Simple text markups are not so simple. To take full advantage of it, one needs a certain level of skills. Try to give a translator the `.po` file. How many of them will be ready to make a translation? Or they'll ask you for text in a more traditional format like Microsoft Word.
ru: * Простая текстовая разметка -- не такая уж и простая. Использование всех возможностей простой текстовой разметки выставляет определенный уровень требований к специалисту по документации. Попробуйте представить переводчику файлы в формате `.po`. Многие ли из них будут готовы сделать перевод? Или попросят предоставить текст в более традиционном формате, например, в Microsoft Word.

source: * Quality control: 58 translated messages, 0 errors, 0 warnings and 0 suggestions in 1 file.
ru: * Контроль качества: 58 переведенных сообщений, 0 ошибок, 0 предупреждений и 0 предложений в 1 файле.
